In [43]:
import numpy as np
import pandas as pd

In [44]:
holi=pd.read_excel("holidays.xlsx")
pe=pd.read_csv("promotional_expense.csv")
tr=pd.read_csv("yds_train2018.csv")
te=pd.read_csv("yds_test2018.csv")

print(holi.shape)
print(pe.shape)
print(tr.shape)
print(te.shape)

(652, 3)
(435, 5)
(79072, 8)
(105, 6)

In [45]:
holi.head()

          Date  Country          Holiday
0   2014, 1, 1  Denmark        Nytårsdag
1  2014, 4, 17  Denmark      Skærtorsdag
2  2014, 4, 18  Denmark       Langfredag
3  2014, 4, 20  Denmark         Påskedag
4  2014, 4, 21  Denmark   Anden påskedag

In [46]:
pe.head()

   Year  Month    Country  Product_Type  Expense_Price
0  2013      1  Argentina             1      14749.307
1  2013      1  Argentina             2       1329.374
2  2013      1    Belgium             2        249.590
3  2013      1   Columbia             1       1893.122
4  2013      1   Columbia             2       1436.726

In [47]:
tr.head()

   S_No  Year  Month  Week Merchant_ID  Product_ID    Country     Sales
0     1  2013      1     1     ar00001           1  Argentina  157500.0
1     2  2013      1     1     ar00003           1  Argentina   39375.0
2     3  2013      1     1     ar00004           1  Argentina   15750.0
3     4  2013      1     1     ar00007           1  Argentina   47250.0
4     5  2013      1     1     ar00008           1  Argentina  283500.0

In [48]:
te.head()

    S_No  Year  Month  Product_ID    Country  Sales
0  79073  2016      4           1  Argentina    NaN
1  79074  2016      5           1  Argentina    NaN
2  79075  2016      6           1  Argentina    NaN
3  79076  2016      7           1  Argentina    NaN
4  79077  2016      8           1  Argentina    NaN

In [49]:
test=te
test['Expense_Price']=" "
test['Th']=" "
te=te.values

train=tr
train['Expense_Price']=" "
train['Th']=" "
tr=tr.values

In [50]:
train.shape

(79072, 10)

In [51]:
trnew=pd.DataFrame(columns=["Year","Month","Product_ID","Country","Sales"])
i=0
v=0
s=0
l=[]
while(i<len(train)):
    l=[]
    s=tr[i][7]
    j=i+1
    y=tr[i][1]
    m=tr[i][2]
    p=tr[i][5]
    c=tr[i][6]
    
    while(j<len(train) and tr[j][1]==y and tr[j][2]==m and tr[j][5]==p and tr[j][6]==c):
        s=s+tr[j][7]
        j=j+1
       
    l.append(int(y))
    l.append(int(m))
    l.append(int(p))
    l.append(str(c))
    l.append(int(s))
    trnew.loc[-1] =l
    trnew.index = trnew.index + 1  # shifting index
    trnew.sort_index(inplace=True) 

    v=v+1
    s=0
    i=j

In [52]:
trnew.head()

   Year Month Product_ID  Country     Sales
0  2015    10          4  Finland  31268810
1  2015     9          4  Finland  28817795
2  2015     8          4  Finland  28765114
3  2015     7          4  Finland  28287106
4  2015     6          4  Finland  31931776

In [53]:
train=trnew
train['Expense_Price']=" "
train['Th']=" "
tr=trnew.values

pex=pe
pe=pe.values

In [54]:
tr[:,5]=-99
for i in range(len(pe)):
    for j in range(len(tr)):
        if(pe[i][3]==tr[j][2] and pe[i][2]==tr[j][3] and pe[i][0]==tr[j][0] and pe[i][1]==tr[j][1]):
            tr[j][5]=pe[i][4]
            
            
            
te[:,6]=-99
for i in range(len(pe)):
    for j in range(len(te)):
        if(pe[i][3]==te[j][3] and pe[i][2]==te[j][4] and  pe[i][0]==te[j][1] and pe[i][1]==te[j][2]):
            te[j][6]=pe[i][4]

In [55]:
tr[:,6]=-99
i=0
s=0

while(i<len(tr)):
    y=tr[i][0]
    p=tr[i][2]
    s=tr[i][1]
    j=i+1
    while(j<len(tr) and tr[j][0]==y and tr[j][2]==p):
        
        s=s+tr[j][1]
        j=j+1
        k=j

    while(i<len(tr) and i<=k):
        tr[i][6]=s
        i=i+1      
    i=i+1

In [56]:
 
te[:,7]=-99
i=0
s=0

while(i<len(te)):
    y=te[i][1]
    p=te[i][3]
    s=te[i][2]
    j=i+1
    while(j<len(te) and te[j][0]==y and te[j][2]==p):
        
        s=s+te[j][1]
        j=j+1
        k=j

    while(i<len(te) and i<=k):
        te[i][7]=s
        i=i+1      
    i=i+1

In [57]:
tr=pd.DataFrame(tr,columns=train.columns)
pe=pd.DataFrame(pe,columns=pex.columns)
te=pd.DataFrame(te,columns=test.columns)

In [58]:
holi['Date']=pd.to_datetime(holi['Date'],format='%Y, %m, %d', errors='coerce')

In [59]:
holi['Date'] = holi['Date'].dt.strftime('%Y/%m/%d')
holi.head()

         Date  Country          Holiday
0  2014/01/01  Denmark        Nytårsdag
1  2014/04/17  Denmark      Skærtorsdag
2  2014/04/18  Denmark       Langfredag
3  2014/04/20  Denmark         Påskedag
4  2014/04/21  Denmark   Anden påskedag

In [60]:
#holi['Date']=pd.to_datetime(holi['Date'],format='%Y/%m/%d', errors='coerce')

In [61]:
#df=trp.merge(holi, on=['Country',holi['Date'].dt.year,holi['Date'].dt.month], how='outer')

In [62]:
#df.isnull().sum()

In [63]:
#df.isnull().sum()

In [64]:
dfr=tr.drop(['Product_ID'],axis=1)

from sklearn import preprocessing
le = preprocessing.LabelEncoder()
dfr['Country']=le.fit_transform(dfr['Country'].astype(str))
dfr.head()

   Year Month  Country     Sales Expense_Price  Th
0  2015    10        5  31268810       900.083  55
1  2015     9        5  28817795       900.083  55
2  2015     8        5  28765114       900.083  55
3  2015     7        5  28287106       900.083  55
4  2015     6        5  31931776       900.083  55

In [65]:
dfrt=te.drop(['Product_ID','Sales','S_No'],axis=1)

from sklearn import preprocessing
le = preprocessing.LabelEncoder()
dfrt['Country']=le.fit_transform(dfrt['Country'].astype(str))
dfrt.head()

   Year Month  Country Expense_Price Th
0  2016     4        0       8427.01  4
1  2016     5        0       8427.01  4
2  2016     6        0       8427.01  4
3  2016     7        0       8427.01  4
4  2016     8        0       8427.01  4

In [66]:
def smape(A, F):
    return 100/len(A) * np.sum(2 * np.abs(F - A) / (np.abs(A) + np.abs(F)))

In [67]:
from sklearn.ensemble import RandomForestRegressor
from xgboost import XGBRegressor
from sklearn.neighbors import KNeighborsRegressor
from sklearn.ensemble import AdaBoostRegressor
from sklearn.cross_validation import cross_val_predict


neigh = KNeighborsRegressor(n_neighbors=5)

rf = RandomForestRegressor(n_jobs=-1)
xgb=XGBRegressor()
adb=AdaBoostRegressor()

In [68]:
y=dfr['Sales']
dfr=dfr.drop(["Sales"],axis=1)

In [30]:
'''from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

temp=scaler.fit_transform(dfr)

dfr=pd.DataFrame(temp,columns=dfr.columns)

temp=scaler.fit_transform(dfrt)

dfrt=pd.DataFrame(temp,columns=dfrt.columns)'''

'from sklearn.preprocessing import StandardScaler\n\nscaler = StandardScaler()\n\ntemp=scaler.fit_transform(dfr)\n\ndfr=pd.DataFrame(temp,columns=dfr.columns)\n\ntemp=scaler.fit_transform(dfrt)\n\ndfrt=pd.DataFrame(temp,columns=dfrt.columns)'

In [36]:
dfr=dfr.astype(int)
dfrt=dfrt.astype(int)

In [39]:
'''yp=cross_val_predict(xgb,dfr,y,n_jobs=-1,cv=150)
xgb.fit(dfr,y)

yt=xgb.predict(dfrt)
dfr['xgb']=yp
dfrt['xgb']=yt'''

In [40]:
'''yp=cross_val_predict(neigh,dfr,y,n_jobs=-1,cv=150)
neigh.fit(dfr,y)

yt=neigh.predict(dfrt)
dfr['neigh']=yp
dfrt['neigh']=yt'''

In [78]:
'''from sklearn.neural_network import MLPRegressor
reg = MLPRegressor(hidden_layer_sizes=(10,200,100),  activation='relu', solver='adam',    alpha=0.001,batch_size='auto',
               learning_rate='constant', learning_rate_init=0.01, power_t=0.5, max_iter=1000, shuffle=True,
               random_state=None, tol=0.0001, verbose=False, warm_start=False, momentum=0.9,
               nesterovs_momentum=True, early_stopping=False, validation_fraction=0.1, beta_1=0.9, beta_2=0.999,
               epsilon=1e-08)'''
yp=cross_val_predict(rf,dfr,y,n_jobs=-1,cv=160)

In [79]:
for i in range(len(yp)):
    if(yp[i]==0):
        yp[i]=1
for i in range(len(y)):
    if(y[i]==0):
        y[i]=1
print(smape(yp,y))

16.630202456959047

In [81]:
rf.fit(dfr,y)
yans=rf.predict(dfrt)

In [ ]:
df_fin=te
df_fin['Sales']=yans

In [ ]:
df_fin=df_fin.drop(['Expense_Price'],axis=1)

In [ ]:
import csv
df_fin.to_csv('yans.csv', index=False)